{       "newsDb":[
           {
            "id": 0,
            "col": "left",
            "header": "COVID-19",
            "title":"Coronavirus: un virus mutant moins agressif, selon une étude", 
            "desc":"Depuis l’émergence du syndrome respiratoire aigu sévère du coronavirus 2 (SRAS-CoV-2), des chercheurs de partout dans le monde travaillent à cartographier la diversité génétique du virus et pour en identifier les variantes. Une récente étude publiée en ligne sur le site BioEMedicine de The Lancet démontre l’apparition d’un virus mutant devenu moins agressif.", 
            "url":"https://journalmetro.com/sante/2506109/coronavirus-un-virus-mutant-mois-agressif-selon-une-etude/?fbclid=IwAR3AMk2fsEzTr3jo9OBxuLScfwwWI6ndS0sXaf_cUrq0yHjiUMBC5B6ld38",
            "img":"https://journalmetro.com/wp-content/uploads/2020/08/GettyImages-1268262084-e1598622249674.jpg?w=860",
            "class":"card1",
            "source":"journalmetro.com"
          },
          {
            "id": 1,
            "col": "left",
            "header": "",
            "title":"Un couvre-visage plus symbolique que sanitaire", 
            "desc":"«Si le nombre de décès et de cas ayant justifié la normalisation du couvre-visage sont actuellement si bas, qu’est-ce qui nous permettra de l’enlever ? Si on applique un tel décret en plein été, quand retournerons-nous à la normale ? Devrons-nous porter ad vitam aeternam ce satané chiffon au visage ? Est-ce vraiment ce visage glauque et sinistre que nous désirons proposer aux prochaines générations ? Bref, devons-nous réellement museler la vie pour mieux sauver la mort ? Le questionnement et la pensée critique sont toujours un signe de santé, non de folie.»", 
            "url":"https://www.ledevoir.com/opinion/idees/582987/un-couvre-visage-plus-symbolique-que-sanitaire?fbclid=IwAR3IzqsXqN8ZY53fWwcCytU4RTAnt3jmGEFk_0fvYE42t_58hmlJJ0ryZow",
            "img":"https://media2.ledevoir.com/images_galerie/nwd_827899_657629/image.jpg",
            "class":"card3",
            "source":"ledevoir.com"
          },
          {
            "id": 2,
            "col": "middle",
            "header": "Mon Opinion",
            "title":"La COVID-19 a muté et perdu toute sa virulence.", 
            "desc":"Le Dr. Raoult l’avait prédit, de nouvelles recherches le confirme, et maintenant en voici la preuve irréfutable. La COVID-19 a muté et est maintenant passé au statut de grippe saisonnière. Peut-on passer à autre chose et revenir à la normale maintenant?", 
            "url":"https://twitter.com/MadPharmacist1/status/1299471277980348416/photo/1",
            "img":"https://pbs.twimg.com/media/EgimNFxX0AAuaGN?format=jpg&name=4096x4096",
            "class":"card1",
            "source":"Gouvernement espagnol"
          },
          {
            "id": 3,
            "col": "middle",
            "header":"En Anglais",
            "title":"Why the Bill Gates global health empire promises more empire and less public health", 
            "desc":"Behind a veil of corporate media PR, the Gates Foundation has served as a vehicle for Western capital while exploiting the Global South as a human laboratory. The coronavirus pandemic is likely to intensify this disturbing agenda.", 
            "url":"https://thegrayzone.com/2020/07/08/bill-gates-global-health-policy/",
            "img":"https://i0.wp.com/thegrayzone.com/wp-content/uploads/2020/07/Bill-Gates-Foundation-WHO-coronavirus-covid.jpg?resize=845%2C450&ssl=1",
            "class":"card1",
            "source":"thegrayzone.com"
          },
          {
            "id": 4,
            "col": "left",
            "header": "",
            "title":"Tenter d'éradiquer le coronavirus a un coût social trop élevé, disent des experts", 
            "desc":"Chercher à éliminer chaque cas de COVID-19 est irréaliste, avancent 18 spécialistes de la santé, dans une lettre aux premiers ministres du pays.", 
            "url":"https://ici.radio-canada.ca/nouvelle/1718543/covid-mesures-sante-publique-confinement-impacts-sociaux-pauvres-enfants-experts?fbclid=IwAR2pBEW-TINGQDgUoqpm5iQjlcCV6BUPmiwGPbPf70mA19bSRj9qVZ2Ly64",
            "img":"https://images.radio-canada.ca/q_auto,w_1250/v1/ici-info/16x9/enfants-filles-fillettes-masque.jpg",
            "class":"card2",
            "source": "ici.radio-canada.ca"
          },
          {
            "id": 5,
            "col": "right",
            "header": "Opinion",
            "title":"ÇA VA FAIRE",
            "desc":"Je ne sais pas pour vous, mais moi, je n’ai pas envie de donner mon nom et encore moins mon numéro de téléphone ou mon adresse de courriel en entrant dans un bar.",
            "url":"https://plus.lapresse.ca/screens/45831c1b-341a-4ff5-89f1-acc407d219ca__7C___0.html?utm_content=twitter&utm_source=lpp&utm_medium=referral&utm_campaign=internal+share",
            "img":"http://plus.lapresse.ca/screens/captures/45831c1b/341a/4ff5/89f1/acc407d219ca_0.jpg",
            "class":"card1",
            "source":"lapresse.ca"
          },
          {
            "id": 6,
            "col": "middle",
            "header": "Éducation",
            "title":"Des données encourageantes, surtout pour les écoles primaires",
            "desc":"Le risque zéro n’existe pas, mais les statistiques et de premières études sur le sujet semblent montrer que les éclosions de COVID-19 sont demeurées rares dans les écoles primaires qui étaient ouvertes au printemps, au Québec et dans certains pays du monde.",
            "url":"https://www.lapresse.ca/covid-19/2020-08-05/des-donnees-encourageantes-surtout-pour-les-ecoles-primaires.php",
            "img":"https://mobile-img.lpcdn.ca/lpca/924x/r3996/4cc05f32-d6b4-11ea-b8ad-02fe89184577.jpg",
            "class":"card2",
            "source":"lapresse.ca"
          }
    ],
     "china":[
          {
            "id": 1,
            "col": "left",
            "title":"The WHO obviously waited to declare a pandemic not to irritate China", 
            "desc":"It is indeed quite obvious that the WHO (World Health Organisation) waited so long to declare a pandemic because they did not want to hurt China's feelings...", 
            "url":"https://foreignpolicy.com/2020/05/27/who-health-china-coronavirus-tedros/",
            "img":"https://toogreen.ca/china-static/img/news-covid-1.jpg",
            "class":"card1",
            "source":"foreignpolicy.com"
          },
          {
            "id": 2,
            "col": "left",
            "title":"Hollywood Has No Balls", 
            "desc":"The new Top Gun movie has removed a Taiwanese and Japanse flag just to please Xi Jinping... Suckers! It seems like Hollywood are a bunch of pedophiles who have no balls!", 
            "url":"https://www.cnn.com/2019/07/22/media/top-gun-flags-intl-hnk/index.html",
            "img":"https://toogreen.ca/china-static/img/img2.jpg",
            "class":"card2",
            "source":"cnn.com"
          },
          {
            "id": 3,
            "col": "left",
            "title":"Apple removed app from the App Store which was helping Hong Kong Protesters", 
            "desc":"In an obvious attempt to please the Chinese government, Apple has removed an app from their app store which was helping HK protesters organize their rallies and more.", 
            "url":"https://www.theverge.com/2019/10/10/20907596/apple-hong-kong-protests-app-removed-china",
            "img":"https://toogreen.ca/china-static/img/img3.jpg",
            "class":"card2",
            "source":"theverge.com"
          },
          {
            "id": 4,
            "col": "right",
            "title":"Houston Rockets Kissing China’s Ass", 
            "desc":"A star NBA general manager may lose his job for expressing American values.", 
            "url":"https://www.outsidethebeltway.com/houston-rockets-kissing-chinas-ass/",
            "img":"https://toogreen.ca/china-static/img/img4.jpg",
            "class":"card1",
            "source": "www.outsidethebeltway.com"
          },
          {
            "id": 5,
            "col": "right",
            "title":"Disturbing Stuff Happens When You Use Bing for Chinese-Language Searches",
            "desc":"Shame on Microsoft who censors its own engine in China, which seems to also have consequences abroad as well..",
            "url":"https://time.com/6846/bing-censors-chinese-language-searches-us/",
            "img":"https://api.time.com/wp-content/uploads/2014/02/bing-chinese-censorship.jpg?w=800&quality=85",
            "class":"card3",
            "source":"time.com"
          },
          {
            "id": 6,
            "col": "right",
            "title":"China’s foreign interference likely ‘widespread’ in Canada",
            "desc":"A comprehensive new report has mapped out the structures [..]",
            "url":"https://www.thestar.com/news/canada/2020/06/08/chinas-foreign-interference-likely-widespread-in-canada-says-author-of-new-report.html",
            "img":"",
            "class":"card2",
            "source":"thestar.com"
          }
    ],
         "ProjectsDb": [
        {
            "id": -1,
            "lang": "en",
            "name": "www.toogreen.ca/instagreen",
            "url": "http://www.toogreen.ca/instagreen",
            "desc": "Annstagram clone which I'm currently working on. All built using ReactJS and using Google Firebase as backend. Not finished implementing all features, but fully functional! Feel free to go ahead and test it out.",
            "img": "https://toogreen.ca/cv/img/instagreen.png"
        },
        {
            "id": 0,
            "lang": "fr",
            "name": "www.toogreen.ca/instagreen",
            "url": "http://www.toogreen.ca/instagreen",
            "desc": "Un clone d'Instagram sur lequel je travaille présentement. Le tout en ReactJS et avec Firebase en backend. Je n'ai pas terminé d'ajouter des fonctionalitées, mais le tout est pleinement fonctionel. N'hésitez pas à aller l'essayer.",
            "img": "https://toogreen.ca/cv/img/instagreen.png"
        },
        {
            "id": 1,
            "lang": "en",
            "name": "www.toogreen.ca/lesavoir",
            "url": "http://www.toogreen.ca/lesavoir",
            "desc": "An informative website I recently created to offer a more positive view on the current crisis. It started as an exercise to reproduce the look from 'Le Devoir' newspaper from scratch, but I thought might as well add in some interesting content as well. Hence how it was born. All code from yours truly, no CMS, no Bootstrap was used. I coded both HTML and CSS by myself, and then converted it to a React.js app.",
            "img": "http://toogreen.ca/blog/wp-content/uploads/2020/08/Screen-Shot-2020-08-17-at-9.34.17-PM.png"
        },
        {
            "id": 2,
            "lang": "fr",
            "name": "www.toogreen.ca/lesavoir",
            "url": "http://www.toogreen.ca/lesavoir",
            "desc": "Un site web informatif un peu satirique que j'ai créé d'abord surtout pour pratiquer mes skills CSS. Le tout a commencé par une tentative de reproduire, 'from scratch', le look du journal Le Devoir. J'ai ensuite converti le tout en React.js et ajouté une base de données flat en backend. Tentez de rapetisser votre fureteur pour voir le responsive design en action, ainsi que le changement de logo pour s'accomoder à l'espace écran disponible. Voilà un excellent exemple de ce que l'on peut maintenant faire avec le CSS moderne et sans boilerplate. J'ai tout codé moi-même de A à Z, pas de CMS, ni Bootstrap fut utilisé. tout le code HTML, CSS et React par moi-même.",
            "img": "http://toogreen.ca/blog/wp-content/uploads/2020/08/Screen-Shot-2020-08-17-at-9.34.17-PM.png"
        },
        {
            "id": 3,
            "lang": "en",
            "name": "www.toogreen.ca/meme",
            "url": "http://www.toogreen.ca/meme",
            "desc": "Recent project I created just for fun while learning React.js. This gave me good bases on the React framework and helped me understand a lot better how props, state, and other features work.",
            "img": "http://toogreen.ca/blog/wp-content/uploads/2020/08/image.png"
        },
        {
            "id": 4,
            "lang": "fr",
            "name": "www.toogreen.ca/meme",
            "url": "http://www.toogreen.ca/meme",
            "desc": "Un récent projet que j'ai créé pour pratiquer mes skills sur React.js. Celà m'a permis d'acquérir une bonne base sur ce framework et m'a beaucoup aidé à comprendre comment fonctionne les props, state, et autres fonctionalitées de React.",
            "img": "http://toogreen.ca/blog/wp-content/uploads/2020/08/image.png"
        },
        {
            "id": 5,
            "lang": "en",
            "name": "www.mtversion.ca",
            "url": "https://www.mtversion.ca",
            "desc": "On a very tight budget, we needed to build a website in the least amount of time as well. Hence I thought why not code it by hand based on a Bootstrap template similar to to what I used for MT>Ventures (See below)? And this is how MT>Version was created. Simple but efficient.",
            "img": "https://toogreen.ca/cv/img/projects/mtversion.png"
        },
        {
            "id": 6,
            "lang": "fr",
            "name": "www.mtversion.ca",
            "url": "https://www.mtversion.ca",
            "desc": "Avec un budget très limité, on voulait un site web moderne et bâti en le moins de temps possible. Je me suis donc dit pourquoi ne pas simplement prendre un template bootstrap similaire pour celui utilisé avec MT>Ventures (voir ci-bas)? Et c'est ainsi que MT>Version est né. Simple et efficace.",
            "img": "https://toogreen.ca/cv/img/projects/mtversion.png"
        },
        {
            "id": 7,
            "lang": "en",
            "name": "www.mtventures.ca",
            "url": "https://www.mtventures.ca",
            "desc": "Similarly to MT Version above, this was also built quickly and on a very tight budget, we needed to build a website in the least amount of time as well. Again, with the help of the design team, I used Bootstrap to quickly get this up and running. ",
            "img": "https://toogreen.ca/cv/img/websites/mtventures.png"
        },
        {
            "id": 8,
            "lang": "fr",
            "name": "www.mtventures.ca",
            "url": "https://www.mtventures.ca",
            "desc": "Similaire au site web ci-haut, this fut aussi conçu en peu de temps et avec un budget limité. Avec la collaboration de l'équipe design, j'ai utilisé Bootstrap pour mettre sur pied ce site en un temps record. ",
            "img": "https://toogreen.ca/cv/img/websites/mtventures.png"
        },
        {
            "id": 9,
            "lang": "en",
            "name": "www.sirev.com",
            "url": "https://www.sirev.com",
            "desc": "Softvoyage's travel agency search engine needed to be converted from a desktop-only website to a mobile-friendly app. I've done all the coding from scratch by myself with Bootstrap as a base. Used HTML5 and CSS3 at the best of their possibilities at the time to make this fully responsive.",
            "img": "https://toogreen.ca/cv/img/projects/sirev/sirev.gif"
        },
        {
            "id": 10,
            "lang": "fr",
            "name": "www.sirev.com",
            "url": "https://www.sirev.com",
            "desc": "L'engin de recherche pour agences de voyage (conçu par Softvoyage) avait besoin d'être converti d'une interface 'desktop-only' à une application 'responsive' qui s'adaptait autant aux ordinateurs de bureau qu'aux appareils mobiles. J'ai tout codé 'from scratch' par moi-même avec Bootstrap comme base. Utilisé les technologies HTML5 et CSS3 au maximum de leurs possibiliées modernes pour rendre ce site 100% 'responsive'.",
            "img": "https://toogreen.ca/cv/img/projects/sirev/sirev.gif"
        },
        {
            "id": 11,
            "lang": "en",
            "name": "www.softvoyage.com",
            "url": "https://www.softvoyage.com",
            "desc": "The company needed a major revamp for the main web portal. I've done most of work behind taking a design idea and turning it into a full blown Wordpress template. Used HTML5, CSS3, PHP and jQuery technologies to make everything work as it should. The website presenting a couple of challenges later on a well, for instance adapting all the PHP templates from being simply bilingual (French + English) to a tri-lingual version (added Spanish recently).",
            "img": "https://toogreen.ca/cv/img/projects/softvoyage.png"
        },
        {
            "id": 12,
            "lang": "fr",
            "name": "www.softvoyage.com",
            "url": "https://www.softvoyage.com",
            "desc": "L'entreprise avait besoin d'un redesign majeur pour leur site qui avait un look très passé date. J'ai fait le gros du travail en transformant ce qui est parti d'un design en site web complet basé sur WordPress. Utilisé les technologies HTML5, CSS3, PHP et jQuery pour rendre le tout fonctionnel. Ce site m'a donné quelques petits défis, par exemple il a fallu plus tard faire en sorte que le site ne soit pas seulement bilingue (français + anglais) mais trilingue. J'ai donc mis en place une version espagnole en modifiant le code PHP existant pour rendre celà possible.",
            "img": "https://toogreen.ca/cv/img/projects/softvoyage.png"
        },
        {
            "id": 13,
            "lang": "en",
            "name": "www.avenirmd.com",
            "url": "https://www.avenirmd.com",
            "desc": "This private clinic needed a brand new, better looking Wordpress-based website. Starting from an exisiting template, I have modified its code heavily using CSS3 and jQuery to add some new features, such as making the main pictures becoming in color when rolling the mouse over them, as well as adding sub-menus and right sidebar, etc. It was the first time I used jQuery extensively and some interesting CSS3 newer features.",
            "img": "https://toogreen.ca/cv/img/projects/avenirmd.png"
        },
        {
            "id": 14,
            "lang": "fr",
            "name": "www.avenirmd.com",
            "url": "https://www.avenirmd.com",
            "desc": "Cette clinique privée avait besoin d'un nouveau site basé sur Wordpress. En partant d'un gabarit (template) existant, j'ai modifié à fond le CSS3 et inséré du jQuery pour ajouter de nouvelles fonctionnalitées, comme transformer les images (de noir et blanc à couleur) sur roll-over, ainsi qu'ajouté des sous-menus et un menu de droite, etc. C'était la première fois que j'ai utilisé jQuery et développé des fonctionnalités CSS3 modernes.",
            "img": "https://toogreen.ca/cv/img/projects/avenirmd.png"
        },
        {
            "id": 15,
            "lang": "en",
            "name": "www.suis.com.cn",
            "url": "https://www.suis.com.cn",
            "desc": "Shanghai's « Xiehe Education Group » manages several schools around Shanghai. I am the one who created their portal, from the installation and configuration of the Linux server, followed by the installation and set up of the Drupal CMS, as well as the graphic signature which I designed by modifying an existing Drupal template. I also added a bit of PHP code for extras. It's also myself who has put in place their email server as well as the Learning Management System based on the Moodle Open Source software.",
            "img": "https://toogreen.ca/cv/img/projects/suis.png"
        },
        {
            "id": 16,
            "lang": "fr",
            "name": "www.suis.com.cn",
            "url": "https://www.suis.com.cn",
            "desc": "Le groupe 'Xiehe Education' gère plusieurs écoles internationales au travers Shanghai. Je suis celui qui a créé leur portail, de l'installation et la configuration du serveur Linux, suivi par l'installation et configuration du CMS Drupal, ainsi que créé la signature graphique que j'ai créé en modifiant les thèmes Drupal existants. J'ai aussi ajouté du code PHP pour quelques extras. C'est aussi moi qui a mis-en-place leur serveur courriel ainsi que leur LMS basé sur le logiciel libre Moodle.",
            "img": "https://toogreen.ca/cv/img/projects/suis.png"
        },
        {
            "id": 16,
            "lang": "en",
            "name": "Students Administration Desk",
            "url": "",
            "desc": "I have extended this in-house developed management system, based on PHP and MySQL by building on top of its original source code. At the time I left, this system was still being used to manage information about students, take daily attendance, set up buses, write comments, etc. My contribution consists in two modules that I created from scratch and integrated into the existing system: <ol><li>On-line reports web interface which allows teachers to input students' grades, as well as store, view and print reports directly on-line.</li><li>A web interface allowing teachers to input their lesson plans directly on-line and from home, as well as sharing them with other teachers. </li></ol>",
            "img": "https://toogreen.ca/cv/img/projects/sad.png"
        },
        {
            "id": 17,
            "lang": "fr",
            "name": "Students Administration Desk",
            "url": "",
            "desc": "J'ai grandement contribué au développement de ce sytème de gestion, basé sur PHP et MySQL en contribuant à l'élaboration de son code source. Quand j'ai quitté Shanghai, ce système était encore utilisé pour gérer l'information sur les étudiants, prendre les présences quotidiennes, gérer les autobus, commentaires, etc. Ma contribution consiste en 2 modules que j'ai créé à partir de zéro: <ol><li>Bulletins en ligne et interface client web permettant aux enseignants d'entrer les notes des étudiants, ainsi que sauvegarder, visualiser et imprimer les bulletins.</li><li>Une interface web permettant aux enseignants de préparer leurs plans de cours en ligne et de la maison, et de partager ceux-ci avec les autres enseignants. </li></ol>",
            "img": "https://toogreen.ca/cv/img/projects/sad.png"
        },
        {
            "id": 18,
            "lang": "en",
            "name": "photojournaliste.ca",
            "url": "",
            "desc": "A website I've built in 2003 for a photographer friend which was also based in Shanghai. He needed a website to promote himself and his portfolio. This was the very first website in which I used the PHP and MySQL technologies. Again I've done everything, from scanning the original pictures from film, to graphic design then HTML slicing and PHP, MySQL, HTML, CSS and JavaScript programming. Thanks to PHP/MySQL, this website could be easily updated by his owner, for example adding text or photos, without having to do any programming or requiring my assistance.",
            "img": "https://toogreen.ca/cv/img/projects/phil.png"
        },
        {
            "id": 19,
            "lang": "fr",
            "name": "photojournaliste.ca",
            "url": "",
            "desc": "Un site web que j'ai conçu en 2003 pour un ami photographe qui était aussi basé à Shanghai. Il avait besoin d'un site web pour se promouvoir et afficher son portfolio. La raison pour laquelle j'en fait mention est parce que c'est le tout premier site web avec lequel j'ai utilisé les technologies PHP and MySQL, ce qui lui permettait de mettre lui-même son site à jour (pour l'époque c'était pas mal). Encore une fois j'ai tout fait moi-même, de la numérisation des photos et films originaux, au design graphique et l'intégration du tout en HTML, PHP, MySQL, CSS et JavaScript. ",
            "img": "https://toogreen.ca/cv/img/projects/phil.png"
        }
    ]
}